In [1]:
import numpy as np
import pandas as pd

In [6]:
data = {
    'name' : "jibran",
    "age " : 20,
    "semsiter ": 3,
    "university" : "Ned",
    "father " :"saleem",
    'mother': "Nisha",
    "sister" : "Samar",
    "birthday"  : "29 of Jan"
}
d = pd.Series(data)

HEAD AND TAIL


In pandas, head() and tail() are methods used to view the first or last few rows of a DataFrame or Series. They are especially useful for quickly inspecting data, especially when working with large datasets.

head()

Returns the first n rows of a DataFrame or Series.


By default, it returns the first 5 rows.

In [13]:
print(d.head())
print(d.head(4))

name          jibran
age               20
semsiter           3
university       Ned
father        saleem
dtype: object
name          jibran
age               20
semsiter           3
university       Ned
dtype: object

In [16]:
print(d.tail())
print(d.tail(d.size))

university          Ned
father           saleem
mother            Nisha
sister            Samar
birthday      29 of Jan
dtype: object
name             jibran
age                  20
semsiter              3
university          Ned
father           saleem
mother            Nisha
sister            Samar
birthday      29 of Jan
dtype: object

Sample

In pandas, the sample() method is used to randomly sample a specified number of rows from a DataFrame or Series. This is useful when you want to quickly select a subset of your data for testing, analysis, or to get a quick glimpse of your data in a randomized order.

In [23]:
d.sample()
#take optional argument n  to return n of random rows, but by default return only 1 random row

father     saleem
dtype: object

**value_counts**

In pandas, the value_counts() method is used to count the unique values in a Series and return them as a frequency count. It is very useful when you want to know how many times each unique value appears in a column (or Series).

return the count in decending order i.e 10 9 8 7..

In [24]:
d.value_counts()

jibran       1
20           1
3            1
Ned          1
saleem       1
Nisha        1
Samar        1
29 of Jan    1
Name: count, dtype: int64

**sort_values()**

it does not sort orignal data


In pandas, the sort_values() method is used to sort the rows of a DataFrame or Series by the values of one or more columns. It provides an easy way to arrange your data in either ascending or descending order.

In [27]:
marks = {
    "maths" : 100,
    "chem"  : 40,
    "Eng" : 29,
    "dld" : 50
}
m = pd.Series(marks)
m.sort_values()

#printing in decending
m.sort_values(ascending=False)

maths    100
dld       50
chem      40
Eng       29
dtype: int64

In [45]:
#print the  highest marks of your result
marks = {
    "maths" : 100,
    "chem"  : 40,
    "Eng" : 29,
    "dld" : 50
}
m = pd.Series(marks)
m.sort_values(ascending=False).head(1).values[0]
# want particular value from series use iloc
#print the leask marks
m.sort_values(ascending=False).iloc[m.size-1]

#if want to sort orignal data use inpalce = True
m.sort_values(ascending=False,inplace = True)
print(m)

29

Sort_index :

same as sort value but for index

In [48]:
marks = {
    "maths" : 100,
    "chem"  : 40,
    "Eng" : 29,
    "dld" : 50
}
#sort the subject sort alphabatically
c
m.sort_index()
#to sort perminantly
m.sort_index(inplace=True)

**Series Maths Methods**

count

Diff between size and count , size counts missing values too i.e nan but
count only counts existing values not nan values

In [51]:
marks = {
    "maths" : 100,
    "chem"  : 40,
    "Eng" : 29,
    "dld" : 50,
    "physics" :np.nan
}
m = pd.Series(marks)
m.count()

4

Sum and product

In [53]:
m.sum()# summ of all values
m.product() #product of all values

5800000.0

mean ,median , mod,standard variation ,varience

In [56]:
print(m.median)
print(m.mode)
print(m.std)
print(m.var)

<bound method Series.median of maths      100.0
chem        40.0
Eng         29.0
dld         50.0
physics      NaN
dtype: float64>
<bound method Series.mode of maths      100.0
chem        40.0
Eng         29.0
dld         50.0
physics      NaN
dtype: float64>
<bound method Series.std of maths      100.0
chem        40.0
Eng         29.0
dld         50.0
physics      NaN
dtype: float64>
<bound method Series.var of maths      100.0
chem        40.0
Eng         29.0
dld         50.0
physics      NaN
dtype: float64>

min and max

In [57]:
print(m.min())
print(m.max())

29.0
100.0

describe

The describe() method in pandas is used to generate basic summary statistics for a DataFrame or Series. It's a quick and easy way to get a high-level overview of your data, including things like the mean, standard deviation, and percentiles.

By default, describe() will summarize numeric columns in the DataFrame, giving you the following statistics:

count: The number of non-null entries.


mean: The average of the values.


std: The standard deviation (how spread out the values are).


min: The minimum value.


25%: The first quartile (25th percentile).


50%: The median (50th percentile).


75%: The third quartile (75th percentile).


max: The maximum value.

In [58]:
m.describe()

count      4.000000
mean      54.750000
std       31.362132
min       29.000000
25%       37.250000
50%       45.000000
75%       62.500000
max      100.000000
dtype: float64

INDEXING

In [60]:
values = np.array([1,2,3,4,5])
v = pd.Series(values)
v[0]

1

Negetive indexing does not work with iloc only

if the keys are string the neg indexing works but if are integers then wont work

In [61]:
v[::2]

0    1
2    3
4    5
dtype: int64

In [69]:
marks = {
    "maths" : 100,
    "chem"  : 40,
    "Eng" : 29,
    "dld" : 50,
}
m = pd.Series(marks)
m["maths"]
m[0]
m.iloc[0]
m.index[-1]

<ipython-input-69-bb11bc047a40>:9: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  m[0]

'dld'

In [75]:
l = {"a":1,"b":2,"c":3}
d = pd.Series(l)
d[-1]

<ipython-input-75-55b2343ce39d>:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  d[-1]

3

Slicing

In [99]:
data = {
    "imran" : 23,
    "shahruk khan" : 20,
    "jibran" :29,
    "sajjad" : 0,
    "umar" : 12
}
d = pd.Series(data)
d[1:]
d[::-1]#reversing the series
d[-2:0:-1] ##slicing as we do in python
d[-3:]#last 3
d[::2] # even evens
d[::-2] # odd ones from last

umar      12
jibran    29
imran     23
dtype: int64

Fancy indexing

In [102]:
d[["imran","sajjad"]]
d[[3,1]]

<ipython-input-102-5704e7bc005b>:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  d[[3,1]]

sajjad           0
shahruk khan    20
dtype: int64

Fancy indexing